using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp
{
    /*
    1 Получать список книг определенного жанра и вышедших между определенными годами.
    2 Получать количество книг определенного автора в библиотеке.

    3 Получать количество книг определенного жанра в библиотеке.
    4 Получать булевый флаг о том, есть ли книга определенного автора и с определенным названием в библиотеке.
    5 Получать булевый флаг о том, есть ли определенная книга на руках у пользователя.

    6 Получать количество книг на руках у пользователя +
    7 Получение последней вышедшей книги.

    8 Получение списка всех книг, отсортированного в алфавитном порядке по названию.

    9 Получение списка всех книг, отсортированного в порядке убывания года их выхода.
    */
}
